hash_en = {"A": "Ф", "B": "И", "C": "С", "D": "В", "E": "У", "F": "А", "G": "П", "H": "Р", "I": "Ш", "J": "О", "K": "Л", "L": "Д", "M": "Ь", "N": "Т", "O": "Щ", "P": "З", "Q": "Й", "R": "К", "S": "І", "T": "Е", "U": "Г", "V": "М", "W": "Ц", "X": "Ч", "Y": "Н", "Z": "Я", "q": "й", "w": "ц", "e": "у", "r": "к", "t": "е", "y": "н", "u": "г", "i": "ш", "o": "щ", "p": "з", "[": "х","{": "Х", "}": "Ї", "]": "ї", "a": "ф", "s": "і", "d": "в", "f": "а", "g": "п", "h": "р", "j": "о", "k": "л", "l": "д", ";": "ж", ":": "Ж", "\"": "Є", "'": "є", "z": "я", "x": "ч", "c": "с", "v": "м", "b": "и", "n": "т", "m": "ь", ",": "б", "<": "Б", ".": "ю", ">": "Ю", "/": ".", "?": ",", " ": " "}
print "Enter your text: " 
array_le = gets.chomp.split("")
array_le.size.times { |count| array_le[count] = hash_en[:"#{array_le[count]}"] }
puts array_le.join
